
user.UniqueUsername.message = T\u00ean \u0111\u0103ng nh\u1eadp \u0111\u00e3 t\u1ed3n t\u1ea1i, t\u00ean \u0111\u0103ng nh\u1eadp kh\u00f4ng \u0111\u01b0\u1ee3c ch\u1ee9a k\u00fd t\u1ef1 \u0111\u1eb7c bi\u1ec7t
user.UniqueEmail.message = Email \u0111\u00e3 \u0111\u01b0\u1ee3c \u0111\u0103ng k\u00fd
user.email.nullErr = Email kh\u00f4ng \u0111\u01b0\u1ee3c \u0111\u1ec3 tr\u1ed1ng
user.email.invalid = Email kh\u00f4ng h\u1ee3p l\u1ec7
user.username.emptyErr = T\u00ean \u0111\u0103ng nh\u1eadp kh\u00f4ng \u0111\u01b0\u1ee3c \u0111\u1ec3 tr\u1ed1ng
user.username.maxErr = T\u00ean \u0111\u0103ng nh\u1eadp kh\u00f4ng \u0111\u01b0\u1ee3c qu\u00e1 45 k\u00fd t\u1ef1
user.password.emptyErr = M\u1eadt kh\u1ea9u kh\u00f4ng \u0111\u01b0\u1ee3c \u0111\u1ec3 tr\u1ed1ng
user.password.minErr = M\u1eadt kh\u1ea9u ph\u1ea3i c\u00f3 \u00edt nh\u1ea5t 6 k\u00fd t\u1ef1
user.password.regexErr = M\u1eadt kh\u1ea9u ph\u1ea3i ch\u1ee9a \u00edt nh\u1ea5t m\u1ed9t ch\u1eef c\u00e1i th\u01b0\u1eddng, m\u1ed9t ch\u1eef c\u00e1i hoa, m\u1ed9t ch\u1eef s\u1ed1 v\u00e0 m\u1ed9t k\u00fd t\u1ef1 \u0111\u1eb7c bi\u1ec7t
user.confirmPassword.emptyErr = X\u00e1c nh\u1eadn m\u1eadt kh\u1ea9u kh\u00f4ng \u0111\u01b0\u1ee3c \u0111\u1ec3 tr\u1ed1ng
user.roles.emptyErr=Vui l\u00f2ng ch\u1ecdn \u00edt nh\u1ea5t m\u1ed9t vai tr\u00f2
user.dob.nullErr=Vui l\u00f2ng ch\u1ecdn ng\u00e0y sinh
user.dob.pastErr=Vui l\u00f2ng ch\u1ecdn ng\u00e0y sinh h\u1ee3p l\u1ec7
user.passwordConfirmNotMatch.message=M\u1eadt kh\u1ea9u v\u00e0 x\u00e1c nh\u1eadn m\u1eadt kh\u1ea9u ph\u1ea3i tr\u00f9ng nhau
driver.licenseNumber.notBlank=S\u1ed1 gi\u1ea5y ph\u00e9p kh\u00f4ng \u0111\u01b0\u1ee3c \u0111\u1ec3 tr\u1ed1ng.
driver.licenseNumber.size=S\u1ed1 gi\u1ea5y ph\u00e9p kh\u00f4ng \u0111\u01b0\u1ee3c qu\u00e1 50 k\u00fd t\u1ef1.
driver.licenseType.size=Lo\u1ea1i gi\u1ea5y ph\u00e9p kh\u00f4ng \u0111\u01b0\u1ee3c qu\u00e1 10 k\u00fd t\u1ef1.
driver.contactNumber.size=S\u1ed1 \u0111i\u1ec7n tho\u1ea1i li\u00ean h\u1ec7 kh\u00f4ng \u0111\u01b0\u1ee3c qu\u00e1 20 k\u00fd t\u1ef1.
driver.contactNumber.pattern=S\u1ed1 \u0111i\u1ec7n tho\u1ea1i kh\u00f4ng h\u1ee3p l\u1ec7 (ch\u1ec9 ch\u1ee9a s\u1ed1, 10-20 k\u00fd t\u1ef1).
driver.address.size=\u0110\u1ecba ch\u1ec9 kh\u00f4ng \u0111\u01b0\u1ee3c qu\u00e1 255 k\u00fd t\u1ef1.
driver.isActive.notNull=Tr\u1ea1ng th\u00e1i ho\u1ea1t \u0111\u1ed9ng kh\u00f4ng \u0111\u01b0\u1ee3c \u0111\u1ec3 tr\u1ed1ng.
driver.userId.notNull=Ng\u01b0\u1eddi d\u00f9ng li\u00ean k\u1ebft kh\u00f4ng \u0111\u01b0\u1ee3c \u0111\u1ec3 tr\u1ed1ng.









